/* BizSimAI - Brazilian Portuguese Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "Entrar";
"common.logout" = "Sair";
"common.save" = "Salvar";
"common.cancel" = "Cancelar";
"common.error" = "Erro";
"common.loading" = "Carregando...";
"common.success" = "Sucesso";
"common.retry" = "Tentar novamente";
"common.submit" = "Enviar";
"common.back" = "Voltar";
"common.done" = "Concluído";
"common.delete" = "Excluir";
"common.edit" = "Editar";
"common.close" = "Fechar";

/* Authentication */
"auth.professor_login" = "Acesso do Professor";
"auth.student_access" = "Acesso do Aluno";
"auth.username" = "Nome de usuário";
"auth.password" = "Senha";
"auth.student_id" = "ID do Aluno";
"auth.full_name" = "Nome completo";
"auth.team_name" = "Nome da equipe";
"auth.register" = "Registrar e participar";
"auth.sign_in_apple" = "Entrar com Apple";
"auth.sign_in_google" = "Entrar com Google";
"auth.session_expired" = "Sessão expirada. Por favor, entre novamente.";

/* Session */
"session.create" = "Criar Sessão";
"session.join" = "Participar da Sessão";
"session.code" = "Código da Sessão";
"session.round" = "Rodada %d de %d";
"session.status_waiting" = "Aguardando Jogadores";
"session.status_active" = "Em Andamento";
"session.status_completed" = "Concluída";
"session.end" = "Encerrar Sessão";
"session.delete" = "Excluir Sessão";

/* Decisions */
"decision.submit" = "Enviar Decisões";
"decision.submitted" = "Decisões Enviadas";
"decision.over_budget" = "Acima do orçamento";
"decision.invalid" = "Decisões inválidas";

/* Results */
"results.leaderboard" = "Classificação";
"results.profit" = "Lucro";
"results.revenue" = "Receita";
"results.market_share" = "Participação de Mercado";
"results.stock_price" = "Preço da Ação";
"results.cumulative" = "Acumulado";

/* Sync */
"sync.online" = "Online";
"sync.offline" = "Offline";
"sync.syncing" = "Sincronizando...";
"sync.error" = "Falha na sincronização";
"sync.saved_locally" = "Salvo localmente";

/* Professor */
"prof.dashboard" = "Painel";
"prof.sessions" = "Sessões";
"prof.analytics" = "Análises";
"prof.announcements" = "Comunicados";
"prof.grade_mapping" = "Mapeamento de Notas";

/* Student */
"student.team_dashboard" = "Painel da Equipe";
"student.ai_coach" = "Treinador IA";
"student.performance" = "Desempenho";

/* Navigation */
"nav.home" = "Início";
"nav.settings" = "Configurações";
"nav.profile" = "Perfil";
"nav.help" = "Ajuda";

/* Errors */
"error.network" = "Erro de rede. Por favor, verifique sua conexão.";
"error.server" = "Erro no servidor. Por favor, tente novamente mais tarde.";
"error.unauthorized" = "Não autorizado. Por favor, entre novamente.";
"error.not_found" = "Recurso não encontrado.";
